85hzc/ask_433/stm32f1_cube/Src/main.c
/* USER CODE END 0 */

void appInit(void)
{

    runFlag = 1;
    powerFlag = 1;

    //芯片配置相关参数
#if(PROJECTOR_OSRAM)
    eplosCfgFlag = 1;
    eplosSLPxen = DISABLE;
#endif
    //显示相关参数
    programsType = AUTO_ALGORITHM;
    filmProgramIdx = 0;
    filmFrameIdx = 0;
    photoProgramIdx = 0;
    
    Drv_SERIAL_Init();
//#if(PROJECTOR_OSRAM)
    //for fan or led lighting
    Drv_FAN_Init();
//#endif

    oppRFTaskInit();
}

void Drv_SERIAL_Proc(void)
{
    uint8_t *ptr;
    uint8_t data[128];

    //BLE mesh 8258/8269
    if(UsartType2.RX_flag)
    {
        UsartType2.RX_flag = 0;
        ptr = UsartType2.RX_pData;

        memset(data, 0, sizeof(data));
        strncpy(data, ptr, UsartType2.RX_Size);

        #if 1
        printf("BLE rx len=%d  [",UsartType2.RX_Size);
        for(int i=0; i<UsartType2.RX_Size; i++)
        {
            printf("0x%02x ",UsartType2.RX_pData[i]);
        }
        printf("]\r\n");
        #endif

        #if PROJECTOR_CUBE
        AppControlCubeHandle(data);
        #elif(CUBEPLT_SLAVE)
        AppControlCubePltHandle(data, UsartType1.RX_Size);
        #elif PROJECTOR_OSRAM
        AppControlEplosHandle(data);
        #endif
        //HAL_UART_Transmit(&DEBUG_UART, UsartType1.RX_pData, UsartType1.RX_Size, 0xffff);
    }

    //uart sub-control interface
    /*
    if(UsartType1.RX_flag)
    {
        UsartType1.RX_flag = 0;
        ptr = UsartType1.RX_pData;

        memset(key, 0, sizeof(key));
        strncpy(key,ptr,UsartType1.RX_Size);
        //HAL_UART_Transmit(&DEBUG_UART, UsartType1.RX_pData, UsartType1.RX_Size, 0xffff);
    }*/
    
    //debug
    if(UsartType3.RX_flag)
    {
        UsartType3.RX_flag = 0;

        ptr = UsartType3.RX_pData;

        memset(data, 0, sizeof(data));
        strncpy(data, ptr, UsartType3.RX_Size);
        UartDebugControlHandle(data);
        /*
        if(key[0]==8)
        {
            HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
        }
        else if(key[0]==9)
        {
            HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
        }
        */
        //HAL_UART_Transmit(&DEBUG_UART, UsartType3.RX_pData, UsartType3.RX_Size, 0xffff);
    }

#if(CUBE_MASTER)
    if(usartTxFlag)
    {
        HAL_UART_Transmit(&huart1, usartTxData, sizeof(usartTxData), 0xffff);
        usartTxFlag = 0;
    }
    /*
    //transmit in CUBE_play
    #elif(CUBEPLT_MASTER)
    if(usartTxFlag)
    {
        HAL_UART_Transmit(&huart1, usartTxData, sizeof(usartTxData), 0xffff);
        usartTxFlag = 0;
    }*/
#endif

#if 0
    /* 1. read the uart buffer... */
    if (HAL_OK == Drv_SERIAL_Read(single_cmd, 0))
    {
        if (Drv_CMD_Handler(single_cmd) > 0)
        {
            if (CMD_HEADER_REQ == single_cmd[0])
            {
                single_cmd[0] = CMD_HEADER_RSP;
                Drv_SERIAL_Write(single_cmd, 0);
            }
        }
    }
#endif
    /* 2. read the action buffer... */
    if (HAL_OK == Drv_SERIAL_Read_Act(single_cmd))
    {
        //printf("Act location:0x%x 0x%x 0x%x 0x%x\r\n",
        //        single_cmd[0],single_cmd[1],single_cmd[2],single_cmd[3]);
        (void)Drv_CMD_Handler(single_cmd);
    }
}

/******************************************************************************
 Function    : oppRFMsgRecvCallBack
 Description : RF 消息接收回调
 Note        : (none)
 Input Para  : (none)
 Output Para : (none)
 Return      : (none)
 Other       : (none)
******************************************************************************/
void oppRFMsgRecvCallBack(uint8_t *data)
{
    uint8_t ucLen = 0;
    //uint8_t data[20];
    oppPackageCtrlHeader_t *pPackageHeader = (oppPackageCtrlHeader_t *)&data[0];
    u8 isMultiPkg = pPackageHeader->isMultiPackage;
    u8 type = pPackageHeader->multiPackageType;
    u8 index = pPackageHeader->multiPackageIndex;
    static u16 totalLen = 0;

    //ucLen = oppHalUartRecvData(OPP_RF_UART, data, 20);

    isMultiPkg = pPackageHeader->isMultiPackage;
    type = pPackageHeader->multiPackageType;
    index = pPackageHeader->multiPackageIndex;

    if(ucLen > 20 || ucLen < 2)
    {
        return;
    }
    /*
    if(gOppRfFlag.isBusy)
    {
        return;
    }*/

    if(index == 0)
    {
        oppFirstPackage_t *pFirstPackage = (oppFirstPackage_t*)&data[0];

        if(ucLen < 4)
        {
            return;
        }
        totalLen = pFirstPackage->totalLen;
        //OPP_SWAP_S(totalLen);
        totalLen = totalLen&0xff<<8 | totalLen&0xff00>>8;
        
        if(!isMultiPkg)
        {
            if(totalLen > 20)
            {
                return;
            }
            //if(totalLen != ucLen)
            //{
            //    return;
            //}
            memcpy(&msgBuf[0], &pFirstPackage->data[0], totalLen);
            gOppRfFlag.isRecv = 1;
            gOppRfFlag.isBusy = 1;
        }
        else
        {
            if(ucLen != 20)
            {
                return;
            }
            if(type != 0)
            {
                return;
            }
            if(totalLen > 256)
            {
                return;
            }
            memcpy(&msgBuf[0], &pFirstPackage->data[0], 17);
            gOppRfFlag.isRecvHeader = 1;
        }
    }
    else
    {
        oppMainPackage_t *pMainPackage = (oppMainPackage_t*)&data[0];
        
        if(!gOppRfFlag.isRecvHeader)
        {
            return;
        }

        if(!isMultiPkg)
        {
            gOppRfFlag.isRecvHeader = 0;
            return;
        }

        if(type == 2)
        {
            u8 len = ucLen - 1;

            memcpy(&msgBuf[17 + (index-1) * 19], &pMainPackage->data[0], len);
            gOppRfFlag.isBusy = 1;
            gOppRfFlag.isRecv = 1;
            gOppRfFlag.isRecvHeader = 0;
        }
        else if(type == 1)
        {
            if(ucLen != 20)
            {
                gOppRfFlag.isRecvHeader = 0;
                return;
            }
            memcpy(&msgBuf[17 + (index-1) * 19], &pMainPackage->data[0], 19);
        }
        else
        {
            gOppRfFlag.isRecvHeader = 0;
        }
    }
}

int main(void)
{

    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    /* MCU Configuration----------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();  //systick 1ms

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
    MX_TIM1_Init();//for PWM pulse

