85hzc/ask_433/stm32f1_cube/Src/main.c
    if(UsartType2.RX_Size<20)
    {
        if(data[9]==0xd && data[10]==0x3 && data[11]==0x0)
        {
            //runFlag = !runFlag;
            IR_code = REMOTE_MI_OK;
        }
        else if(data[9]==0x11 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_POWER;
            powerFlag = 1;
        }
        else if(data[9]==0x11 && data[10]==0x3 && data[11]==0x0)
        {
            IR_code = REMOTE_MI_POWER;
            powerFlag = 0;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x3)
        {
            IR_code = REMOTE_MI_UP;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x2)
        {
            IR_code = REMOTE_MI_LEFT;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_RIGHT;
        }
        else if(data[9]==0x13 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_PLUS;
        }
        else if(data[9]==0x13 && data[10]==0x3 && data[11]==0x0)
        {
            IR_code = REMOTE_MI_MINUS;
        }

        if (IR_code) {
            Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_IR, CMD_OP_IR_CODE), IR_code);
        }
    }
    else
    {
        oppRFMsgRecvCallBack(data);
    }
    
}
#endif

#if PROJECTOR_CUBE
void AppControlCubeHandle(uint8_t *data)
{
    uint16_t IR_code = 0;
    uint8_t pId,fId,keyval;
    PROGRAMS_TYPE_E ptype;

    if(UsartType2.RX_Size<20)
    {
        if(data[9]==0xd && data[10]==0x3 && data[11]==0x0)
        {
            //runFlag = !runFlag;
            IR_code = REMOTE_MI_OK;
        }
        else if(data[9]==0x11 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_POWER;
            powerFlag = 0;
        }
        else if(data[9]==0x11 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_POWER;
            powerFlag = 1;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x3)
        {
            IR_code = REMOTE_MI_UP;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x2)
        {
            IR_code = REMOTE_MI_LEFT;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_RIGHT;
        }
        else if(data[9]==0x13 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_PLUS;
        }
        else if(data[9]==0x13 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_MINUS;
        }

        if (IR_code) {
            Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_IR, CMD_OP_IR_CODE), IR_code);
        }
    }
    else
    {
        oppRFMsgRecvCallBack(data);
    }
    /*
    ptype = *key++;
    pId = *key++;
    fId = *key;

    printf("AppControlCubeHandle type:%d,pid:%d,fid:%d\r\n",ptype,pId,fId);

    switch(ptype)
    {
        case PHOTO:
            runFlag = 1;
            photoProgramIdx = pId;
            programsType = PHOTO;
            break;

        case FILM:
            runFlag = 1;
            filmProgramIdx = pId;
            filmFrameIdx = fId;
            programsType = FILM;
            break;

        case AUTO_ALGORITHM:
            programsType = AUTO_ALGORITHM;
            
        default:
            break;
    }
    */
}
#endif


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
